{
  "text": "You won’t believe what scientists just discovered about coffee! The shocking truth they don’t want you to know is right here. Click before it’s taken down…",
  "analysis": {
    "factual_accuracy": 0,
    "bias": "other",
    "emotional_tone": "negative",
    "recommendation": "This text should be approached with skepticism due to its lack of direct information, clickbait nature, and potential misinformation.",
    "analysis_explanation": {
      "factual_accuracy": {
        "score": 0,
        "key_indicators": "Lack of direct information, reliance on sensationalism.",
        "examples_from_text": "The text provides no specific details or evidence to support its claims.",
        "weight_of_factors": "The sensationalist approach heavily impacts the factual accuracy rating.",
        "comparison_with_similar_content": "Similar clickbait articles often contain exaggerated or unfounded claims."
      },
      "bias": {
        "classification": "other",
        "language_patterns": "Use of sensational language to provoke curiosity or fear.",
        "examples_of_bias": "Phrases like 'shocking truth' and 'they don’t want you to know' suggest a hidden agenda without evidence.",
        "context_and_implications": "Such bias aims to manipulate emotional responses rather than inform.",
        "effect_on_message": "The biased language undermines the credibility of any information presented."
      },
      "emotional_tone": {
        "classification": "negative",
        "emotional_language_patterns": "The text uses language designed to incite fear, surprise, and anticipation.",
        "examples_of_emotional_language": "'You won’t believe', 'shocking truth', 'taken down'",
        "impact_on_message": "The negative tone may affect the reader's emotional state, leading to engagement without critical thinking.",
        "effect_on_credibility": "Emotional manipulation significantly detracts from the text's credibility."
      },
      "recommendation": {
        "text": "This text should be approached with skepticism due to its lack of direct information, clickbait nature, and potential misinformation.",
        "key_factors": "The speculative and emotive nature of the content, combined with its clear clickbait characteristics, severely undermines its credibility.",
        "specific_concerns": "The sensationalist approach and lack of evidence raise concerns about the intention behind the text.",
        "relation_to_other_classifications": "The recommendation is directly related to the analysis of bias, factual accuracy, and emotional tone."
      }
    },
    "article_type": {
      "objective": 0.0,
      "subjective": 0.1,
      "speculative": 0.9,
      "emotive": 0.8,
      "clickbait": 1.0
    },
    "sentiments": {
      "joy": 0.0,
      "trust": 0.0,
      "fear": 0.2,
      "surprise": 0.8,
      "sadness": 0.0,
      "disgust": 0.1,
      "anger": 0.0,
      "anticipation": 0.7
    }
  },
  "timestamp": "2025-06-05T21:33:58.907764"
}