{
  "text": "You won’t believe what scientists just discovered about coffee! The shocking truth they don’t want you to know is right here. Click before it’s taken down…",
  "analysis": {
    "factual_accuracy": 0,
    "bias": "other",
    "emotional_tone": "negative",
    "recommendation": "Due to the lack of specific information and reliance on sensationalism, this content is not recommended for those seeking factual or unbiased information about scientific discoveries related to coffee.",
    "analysis_explanation": {
      "factual_accuracy": {
        "score": 0,
        "key_indicators": "Lack of specific details or evidence.",
        "examples_from_text": "The text does not provide any factual information.",
        "weight_of_factors": "The absence of concrete information significantly impacts the factual accuracy score.",
        "comparison_with_similar_content": "Similar sensationalist headlines often lack factual backing, aligning with this content's characteristics."
      },
      "bias": {
        "classification": "Other",
        "language_patterns": "Use of sensationalist and vague language to provoke curiosity without providing substance.",
        "examples_of_bias": "\"You won’t believe\", \"shocking truth\", \"they don’t want you to know\", \"before it’s taken down…\"",
        "context_and_implications": "Such language suggests an intent to manipulate rather than inform, indicating a bias towards sensationalism and clickbait.",
        "effect_on_message": "This bias undermines the credibility and informative value of the content."
      },
      "emotional_tone": {
        "classification": "Negative",
        "emotional_language_patterns": "Phrases designed to provoke anxiety or fear of missing out.",
        "examples_of_emotional_language": "\"shocking truth they don’t want you to know\", \"before it’s taken down…\"",
        "impact_on_message": "Creates an urgent, negative emotional response rather than providing informative content.",
        "effect_on_credibility": "Such emotional manipulation detracts from the content's credibility."
      },
      "recommendation": {
        "text": "Due to the lack of specific information and reliance on sensationalism, this content is not recommended for those seeking factual or unbiased information about scientific discoveries related to coffee.",
        "key_factors": "Lack of factual information, high speculative and emotive content, and heavy use of clickbait tactics.",
        "specific_concerns": "The content's primary aim appears to be generating clicks rather than providing valuable information.",
        "relation_to_other_classifications": "The recommendation is directly influenced by the content's speculative nature, emotional tone, and the use of clickbait tactics."
      }
    },
    "article_type": {
      "objective": 0.0,
      "subjective": 0.2,
      "speculative": 0.8,
      "emotive": 0.9,
      "clickbait": 1.0
    },
    "sentiments": {
      "joy": 0.0,
      "trust": 0.0,
      "fear": 0.3,
      "surprise": 0.7,
      "sadness": 0.0,
      "disgust": 0.0,
      "anger": 0.0,
      "anticipation": 0.5
    }
  },
  "timestamp": "2025-06-05T21:33:38.492297"
}